run/BM3/BM3_ConvectionOnly/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    {
        name    cylinder1;
        type    cellSet;
        action  new;
        source cylinderToCell;
        sourceInfo
	{
       	    p1       (0.0 0.0 0.0);  
       	    p2       (0.0 0.01 0.0);  
       	    radius   0.004; // 2 or 4 mm
    	}
    }

    {
        name    inlet1;
        type    faceSet;
        action  new;
        source  cellToFace;
        sourceInfo
        {
            set     cylinder1;
            option  all;
        }
    }
    
    // EB: Intesect the faces 'inlet1' with the specific path belonging
    //     to the mesh construction called 'inclinedPlane'
     {
        name inlet1;
        type faceSet;
        action subset;
        source patchToFace;
        sourceInfo
        {
            patch "lowerWall";
        }
    }

    // EB: all the cells belonging to 'cylinder1' are deleted
    {
        name cylinder1;
        type cellSet;
        action remove;
    }
    
    // EB: inspired by
    // https://www.cfd-online.com/Forums/openfoam-pre-processing/198067-creating-circular-inlet-square-face.html    
);

// ************************************************************************* //
